app/controllers/articals_controller.rb

  def index
    @articals = Artical.all
---
SELECT "articals".* FROM "articals" WHERE ((title ILIKE 'Khiêm' or body ILIKE 'Khiêm'))  ORDER BY created_at DESC

  def create
    @artical = Artical.new(artical_params)

    respond_to do |format|
      if @artical.save
---
INSERT INTO "articals" ("title", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "title 1"], ["body", "what the fuuuu is this"], ["created_at", "2016-09-24 16:27:16.968700"], ["updated_at", "2016-09-24 16:27:16.968700"]]

  def update
    respond_to do |format|
      if @artical.update(artical_params)
---
UPDATE "articals" SET "body" = $1, "updated_at" = $2 WHERE "articals"."id" = $3  [["body", "what this\r\nwhat that\r\n[people]\r\nhttp://placeimg.com/200/200/people\r\n[/people]\r\nthe heck ?!"], ["updated_at", "2016-09-24 17:20:37.854778"], ["id", 3]]

  def destroy
    @artical.destroy
---
DELETE FROM "articals" WHERE "articals"."id" = $1  [["id", 4]]

    def set_artical
      @artical = Artical.find(params[:id])
---
SELECT  "articals".* FROM "articals" WHERE "articals"."id" = $1 LIMIT 1  [["id", 4]]